## Filtering on String

In [1]:
import pandas as pd

data ={
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'city': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles'],
    'department': ['HR', 'Finance', 'IT', 'Finance', 'HR'],
    'salary': [70000, 80000, 90000, 85000, 75000]
}

df = pd.DataFrame(data)
df

      name         city department  salary
0    Alice     New York         HR   70000
1      Bob  Los Angeles    Finance   80000
2  Charlie     New York         IT   90000
3    David      Chicago    Finance   85000
4      Eva  Los Angeles         HR   75000

In [ ]:
# String functions

# 1. contains: Get rows where a keyword is present in a string column
filtered_df = df.loc[df['city'].str.contains('New', case=False)]    # contains(keyword, case)
filtered_df

# Can also use regex
filtered_df_regex = df.loc[df['city'].str.contains(r"^New|Chicago$", case=False)]    # contains(regex, case), here ^ indicates starts with and $ indicates ends with, r is for raw string, use {} to escape special characters, [ ] for character set
filtered_df_regex

      name      city department  salary
0    Alice  New York         HR   70000
2  Charlie  New York         IT   90000
3    David   Chicago    Finance   85000

## Adding New Columns

In [2]:
student_data = pd.read_csv('student_data.csv')
student_data['First Name'] = student_data['FullName'].str.split(' ').str[0]   # split by space and get first element
student_data['Total Marks']= student_data['Data Structure Marks'] + student_data['Algorithm Marks'] + student_data['Python Marks']
student_data

# Save the updated DataFrame to a new CSV file
student_data.to_csv('updated_student_data.csv', index=False)

## Check Unique or Null Values

In [ ]:
student_data['FullName'].unique()   # Check unique values in 'FullName' column
print(len(student_data['FullName'].unique()))   # Number of unique values in 'FullName' column

print(student_data.nunique())   # Check number of unique values in 'Python Marks' column

# unique works on only series whereas nunique works on both series and dataframe. unique returns array of unique values whereas nunique returns count of unique values

student_data.isnull()   # Check for null values in the dataframe, if a cell is True then that cell has null value

20
StudentID               20
FullName                20
Data Structure Marks    12
Algorithm Marks         12
Python Marks            12
CompletionStatus         3
EnrollmentDate          20
Instructor               3
Location                 5
First Name              20
Total Marks             11
dtype: int64

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,First Name,Total Marks
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,True,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,True,True,False,False,False,False,False,False,True
5,False,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,True,False,False,False,False,False,True
7,False,False,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False,False,False
10,False,False,True,True,False,False,False,False,False,False,True
11,False,False,False,False,False,False,False,False,False,False,False
12,False,False,False,False,False,False,False,False,False,False,False
13,False,False,True,True,True,False,False,False,False,False,True
14,False,False,False,False,False,False,False,False,False,False,False
15,False,False,False,False,True,False,False,False,False,False,True
16,False,False,False,False,False,False,False,False,False,False,False
17,False,False,False,False,False,False,False,False,False,False,False
18,False,False,True,True,True,False,False,False,False,False,True
19,False,False,False,False,False,False,False,False,False,False,False

In [11]:
student_data.notnull()   # Check for non-null values in the dataframe, if a cell is True then that cell has non-null value

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,First Name,Total Marks
0,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,False,True,True,True,True,True,False
2,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True
4,True,True,False,False,True,True,True,True,True,True,False
5,True,True,True,True,True,True,True,True,True,True,True
6,True,True,True,True,False,True,True,True,True,True,False
7,True,True,True,True,True,True,True,True,True,True,True
8,True,True,True,True,True,True,True,True,True,True,True
9,True,True,True,True,True,True,True,True,True,True,True
10,True,True,False,False,True,True,True,True,True,True,False
11,True,True,True,True,True,True,True,True,True,True,True
12,True,True,True,True,True,True,True,True,True,True,True
13,True,True,False,False,False,True,True,True,True,True,False
14,True,True,True,True,True,True,True,True,True,True,True
15,True,True,True,True,False,True,True,True,True,True,False
16,True,True,True,True,True,True,True,True,True,True,True
17,True,True,True,True,True,True,True,True,True,True,True
18,True,True,False,False,False,True,True,True,True,True,False
19,True,True,True,True,True,True,True,True,True,True,True

In [12]:
student_data['Data Structure Marks'].hasnans   # Check if there is any null value in 'Data Structure Marks' column, returns True or False

True

## Handling Null Values

In [ ]:
# dropna: Risky operation as it may lead to loss of data
student_data.dropna(subset=['Data Structure Marks'])   # Drop rows with any null values, Optional how parameter: 'any' (default) or 'all', if 'any' then drop row if any cell is null, if 'all' then drop row if all cells are null. subset parameter: list of column names to consider for null values

# fillna: Fill null values with a specific value
student_data.fillna(0)   # Fill null values with a specific value, here filling with 0 whether the column is numeric or string
student_data['FullName'].fillna('Unknown')   # Fill null values in 'FullName' column with 'Unknown'
student_data['Data Structure Marks'].fillna(student_data['Data Structure Marks'].mean())   # Fill null values in 'Data Structure Marks' column with the mean of that column

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,First Name,Total Marks
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Alif,258.0
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Fatima,NaN
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,Imran,261.0
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet,Jannatul,238.0
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram,Kamal,NaN
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi,Laila,228.0
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka,Mahmudul,NaN
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram,Nadia,247.0
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka,Omar,220.0
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet,Priya,266.0
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna,Rahim,NaN
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram,Sadia,257.0
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka,Tanvir,229.0
13,PH1014,Urmi Akter,NaN,NaN,NaN,Not Started,2024-07-09,Ms. Salma,Rajshahi,Urmi,NaN
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka,Wahiduzzaman,256.0
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram,Ziaur,NaN
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka,Afsana,273.0
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet,Babul,261.0
18,PH1019,Faria Rahman,NaN,NaN,NaN,Not Started,2025-09-15,Mr. David,Chattogram,Faria,NaN
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka,Nasir,261.0

## Handling Duplicates

In [17]:
student_data.duplicated()   # Check for duplicate rows in the dataframe, if a row is True then that row is duplicate. Use sum() to count total duplicate rows

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [ ]:
# Delete duplicate rows
student_data_no_duplicates = student_data.drop_duplicates()   # Drop duplicate rows and create a new dataframe without duplicates. Inplace parameter can be used to modify the original dataframe directly

In [ ]:
# Delete duplicate rows based on specific value in a column
student_data_no_duplicates_specific = student_data.drop_duplicates(subset=['FullName'], keep='first')   # Drop duplicate rows based on 'FullName' column. Optional keep parameter can be used to specify which duplicate to keep (first, last, False). Default is 'first', that means it keeps the first occurrence and drops the rest

## Statistical Functions in Pandas

In [32]:
student_data = pd.read_csv('student_data.csv')

# For single column statistical functions
student_data['Data Structure Marks'].sum()    # Calculate sum of 'Data Structure Marks' column
student_data['Data Structure Marks'].mean()   # Calculate mean of 'Data Structure Marks' column
student_data['Data Structure Marks'].median()   # Calculate median of 'Data Structure Marks' column
student_data['Data Structure Marks'].mode()   # Calculate mode(highest frequency) of 'Data Structure Marks' column
student_data['Data Structure Marks'].min()    # Calculate minimum of 'Data Structure Marks'
student_data['Data Structure Marks'].max()    # Calculate maximum of 'Data Structure Marks'
student_data['Data Structure Marks'].std()    # Calculate standard deviation of 'Data Structure Marks'
student_data['Data Structure Marks'].var()    # Calculate variance of 'Data Structure Marks'
student_data['Data Structure Marks'].count()   # Count non-null values in 'Data Structure Marks' column

# For multiple columns statistical functions: Pass a list of column names
print(student_data[['Data Structure Marks', 'Algorithm Marks', 'Python Marks']].sum(axis=1))   # Calculate sum of 'Data Structure Marks', 'Algorithm Marks' and 'Python Marks' columns, axis=1 indicates row-wise operation, axis=0 indicates column-wise operation
print(student_data.iloc[::,2:5].mean(axis=0))   # Calculate mean of columns from index 3 to 4 (5 is excluded), axis=0 indicates column-wise operation

print("Data Structure Marks Summary Statistics:")
print(student_data['Data Structure Marks'].describe())   # Get summary statistics of 'Data Structure Marks' column



# Correlation: It measures the statistical relationship between two variables. It indicates how one variable changes in relation to another variable. The correlation coefficient ranges from -1 to 1, where:
# 1 indicates a perfect positive correlation (as one variable increases, the other also increases)
# -1 indicates a perfect negative correlation (as one variable increases, the other decreases)
# 0 indicates no correlation (no relationship between the variables)

student_data[['Data Structure Marks', 'Algorithm Marks']].corr()   # Calculate correlation between 'Data Structure Marks' and 'Algorithm Marks' columns

0     258.0
1     184.0
2     261.0
3     238.0
4      95.0
5     228.0
6     160.0
7     247.0
8     220.0
9     266.0
10     91.0
11    257.0
12    229.0
13      0.0
14    256.0
15    188.0
16    273.0
17    261.0
18      0.0
19    261.0
dtype: float64
Data Structure Marks    84.000000
Algorithm Marks         84.000000
Python Marks            85.666667
dtype: float64
Data Structure Marks Summary Statistics:
count    16.000000
mean     84.000000
std       6.501282
min      72.000000
25%      79.500000
50%      85.500000
75%      88.250000
max      94.000000
Name: Data Structure Marks, dtype: float64

                      Data Structure Marks  Algorithm Marks
Data Structure Marks                   1.0              1.0
Algorithm Marks                        1.0              1.0

## Apply Function
Apply Function enables us to apply a function along an axis of the DataFrame (rows or columns) or on values of Series. It's a customizable way to perform operations on data in pandas without writing explicit loops. It removes the limitations of built-in functions by allowing users to define their own functions and apply them to DataFrame or Series elements.

In [33]:
# Compute range (max - min) only for numeric columns 
numeric_range = student_data.select_dtypes(include=['number']).apply(lambda x: x.max() - x.min())
print("Range of Numeric Columns:\n", numeric_range)

def grade_category(marks):
    if marks >= 90:
        return 'A'
    elif marks >= 80:
        return 'B'
    elif marks >= 70:
        return 'C'
    elif marks >= 60:
        return 'D'
    else:
        return 'F'

student_data['Grade'] = student_data.iloc[::,2:5].sum(axis=1).apply(grade_category)   # Apply grade_category function to 'Total Marks' column and create a new 'Grade' column
student_data

Range of Numeric Columns:
 Data Structure Marks    22.0
Algorithm Marks         22.0
Python Marks            19.0
dtype: float64

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Grade
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,A
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,A
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,A
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet,A
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram,A
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi,A
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka,A
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram,A
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka,A
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet,A
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna,A
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram,A
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka,A
13,PH1014,Urmi Akter,NaN,NaN,NaN,Not Started,2024-07-09,Ms. Salma,Rajshahi,F
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka,A
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram,A
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka,A
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet,A
18,PH1019,Faria Rahman,NaN,NaN,NaN,Not Started,2025-09-15,Mr. David,Chattogram,F
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka,A

## DateTime and Timedelta

In [34]:
# datatime and timedelta
student_data['EnrollmentDate'] = pd.to_datetime(student_data['EnrollmentDate'])   # Convert 'EnrollmentDate' column to datetime format from object format

# Now using dt. we can extract various components of the date
student_data['EnrollmentYear'] = student_data['EnrollmentDate'].dt.year
student_data['EnrollmentMonth'] = student_data['EnrollmentDate'].dt.month
student_data['EnrollmentDay'] = student_data['EnrollmentDate'].dt.day
student_data['Total Days Enrolled'] = (pd.to_datetime("today") - student_data['EnrollmentDate']).dt.days   # Calculate total days enrolled by subtracting 'EnrollmentDate' from a specific date(today())

student_data

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Grade,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,A,2024,1,15,661
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,A,2024,1,20,656
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,A,2024,2,10,635
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet,A,2024,2,12,633
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram,A,2024,3,5,611
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi,A,2024,3,8,608
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka,A,2024,4,1,584
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram,A,2024,4,22,563
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka,A,2024,5,16,539
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet,A,2024,5,20,535
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna,A,2024,6,11,513
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram,A,2024,6,14,510
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka,A,2024,7,2,492
13,PH1014,Urmi Akter,NaN,NaN,NaN,Not Started,2024-07-09,Ms. Salma,Rajshahi,F,2024,7,9,485
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka,A,2024,8,18,445
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram,A,2024,8,21,442
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka,A,2025,9,1,66
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet,A,2025,9,5,62
18,PH1019,Faria Rahman,NaN,NaN,NaN,Not Started,2025-09-15,Mr. David,Chattogram,F,2025,9,15,52
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka,A,2025,10,2,35

## Group By

In [ ]:
# Group students depend on their Instructor

group = student_data.groupby('Instructor')      #It creates a GroupBy object that groups the DataFrame by the values in the 'Instructor' column
group

In [36]:
group.sum(numeric_only=True)   # Calculate sum of each numeric column for each group (Instructor)

,Data Structure Marks,Algorithm Marks,Python Marks,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
Instructor,,,,,,,
Mr. David,147.0,147.0,155.0,6073,21,33,1083
Mr. Karim,429.0,429.0,536.0,14169,33,61,3515
Ms. Salma,768.0,768.0,594.0,20242,55,133,4529

In [37]:
group.min(numeric_only=True)   # Calculate minimum of each numeric column for each group (Instructor)

,Data Structure Marks,Algorithm Marks,Python Marks,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
Instructor,,,,,,,
Mr. David,72.0,72.0,76.0,2024,5,2,52
Mr. Karim,80.0,80.0,84.0,2024,1,1,66
Ms. Salma,75.0,75.0,78.0,2024,1,2,35

In [38]:
group.max(numeric_only=True)   # Calculate maximum of each numeric column for each group (Instructor)

,Data Structure Marks,Algorithm Marks,Python Marks,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
Instructor,,,,,,,
Mr. David,75.0,75.0,79.0,2025,9,16,539
Mr. Karim,90.0,90.0,95.0,2025,9,18,661
Ms. Salma,94.0,94.0,89.0,2025,10,22,656

In [39]:
group.first()   # Get the first row of each group (Instructor)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Location,Grade,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
Instructor,,,,,,,,,,,,,
Mr. David,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Dhaka,A,2024,5,16,539
Mr. Karim,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Dhaka,A,2024,1,15,661
Ms. Salma,PH1002,Fatima Akhter,92.0,92.0,82.0,In Progress,2024-01-20,Chattogram,A,2024,1,20,656

In [40]:
group.last()   # Get the last row of each group (Instructor)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Location,Grade,EnrollmentYear,EnrollmentMonth,EnrollmentDay,Total Days Enrolled
Instructor,,,,,,,,,,,,,
Mr. David,PH1019,Faria Rahman,75.0,75.0,79.0,Not Started,2025-09-15,Chattogram,F,2025,9,15,52
Mr. Karim,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Dhaka,A,2025,9,1,66
Ms. Salma,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Dhaka,A,2025,10,2,35